# -*- coding: utf-8 -*-

'''
Напишите функцию, которая принимает на вход строку и преобразует ее в кортеж
символов.
'''


def get_tuple_string(string):
    return tuple(string)


string_1 = "asd dsa"

print(get_tuple_string(string_1))

