# -*- coding: utf-8 -*-

'''
Напишите функцию, которая принимает на вход строку и возвращает длину этой
строки.
'''


def len_string(string):
    return len(string)


string_1 = "asd dsa  zxc   wer   ert qwe sdf   sdf  "
print(len_string(string_1))
